final String kVideoName = 'Ведіть відеозйомку';
final String kVideoTitle =
    '''Відеофіксація - ефективний інструмент в боротьбі за свої права. Цивільний кодекс дозволяє знімати людину в місцях, відкритих для вільного відвідування, без її згоди, якщо вона не є основним об’єктом зйомки. Тому краще знімати не тільки охоронця, а й інших співробітників магазина, покупців і товари.

1. Фізична особа може бути знята на фото-, кіно-, теле- чи відеоплівку лише за її згодою. Згода особи на знімання її на фото-, кіно-, теле- чи відеоплівку припускається, якщо зйомки проводяться відкрито на вулиці, на зборах, конференціях, мітингах та інших заходах публічного характеру''';
final String kVideoSubtitle =
    'Стаття 307 Цивільного кодексу України. Захист інтересів фізичної особи при проведенні фото-, кіно-, теле- та відеозйомок';

final String kCertificatName = 'Зафіксуйте посвідчення особи, що Вас перевіряє';
final String kCertificatTitle =
    '''Охоронець зобов\'язаний пред\'явити вам посвідчення де вказані його особисті дані (зафіксуйте цю інформацію). 
Часто наглядач в магазині не є охоронцем. Тому не має права вчиняти будь-які дій по відношенню до покупця, так само як не має права носити зброю чи інші спецзасоби. В такому разі потрібно викликати адміністратора магазину.  
ЗАПАМЯТАЙТЕ. Ніякі внутрішні інструкції магазину не мають суперечити законодавству''';
final String kCertificatSubtitle =
    'Стаття 11 Закону України Про охоронну діяльність. Умови залучення громадян до охоронної діяльності';

final String kRelativesName =
    'Повідомте родичів, друзів, журналістів, правозахисників про наявний конфлікт';
final String kRelativesTitle =
    'В разі непередбаченої ситуації, надана інформація дозволить швидко вас знайти і вчасно відреагувати на інцидент, а також, при необхідності, надати масового розголосу протиправним діям';

final String kBagName = 'Вхід з власними речами до магазину';
final String kBagTitle =
    '''1. Суб\'єкт господарювання зобов\'язаний забезпечити доступ споживачів до торговельних об\'єктів без здавання на збереження особистих речей, крім товарів, реалізація яких здійснюється у таких торговельних об\'єктах
2. Якщо залишили свої речі у камері схову закритій на ключ, то уклали з торговельним центром безоплатний публічний договір зберігання, згідно якого торговий заклад несе відповідальність за збереження залишених речей і відшкодовує збитки за втрату (нестачу) або пошкодження речі, прийнятої на зберігання''';
final String kBagSubtitle =
    '''1.  (Постанова КМУ від 15.06.2006 № 833 п. 21  «Про затвердження Порядку провадження торговельної діяльності та правил торговельного обслуговування на ринку споживчих товарів») 
2. Цивільний кодекс України, глава 66; статті 942, 949–951 )
''';

final String kImprinName = 'Фотографування, відеозйомка товару';
final String kImprinTitle =
    '''Закон не забороняє фотографувати товари в магазинах. Заборона-це порушення конституційного права на вільне збирання, зберігання, використання і поширення інформації. 
Стаття 34 Конституції України. Кожному гарантується право на свободу думки і слова, на вільне вираження своїх поглядів і переконань. Кожен має право вільно збирати, зберігати, використовувати і поширювати інформацію усно, письмово або в інший спосіб - на свій вибір.''';
final String kImprinSubtitle =
    'Фіксувати можна все, крім документів, діяльність П гласна ст.9 ч.1 З-н про нац П';

final String kInspectionName = 'Огляд речей';
final String kInspectionTitle =
    '''1. Персонал охорони має право проводити огляд Ваших речей лише за Вашою добровільною згодою.
2. Охоронець не має права Вас затримувати чи проводити огляд Ваших речей. Може лише викликати поліцію та попростити Вас їх дочекатися, але утримувати Вас без конкретних, фактичних підстав, застосовуючи фізичний примус, вони не мають права.
3. Якщо по відношенню до вас застосовується тиск (завели в кімнату охорони, відмовляються випускати з приміщення супермаркету, вимагають документи) слід вказати про заборону нечесної підприємницької практики і агресивної діяльності. Відповідно до закону охорона супермаркету не має права затримувати вас, обмежувати вашу свободу. Поясніть, що це вже їм загрожує судовими або кримінальними розглядами.
''';
final String kInspectionSubtitle =
    '''1). ст. 12 Закону України «Про охоронну діяльність»
2). ст. 264 Кодексу України про адміністративні правопорушення, ст. 16 Закону України «Про охоронну діяльність»
3). 1,4 і 5 статті 19 Закону України «Про захист прав споживачів»''';

final String kShopPoliceName =
    'Підстави для виклику Поліції охоронцем магазину';
final String kShopPoliceTitle =
    '''Охоронець може затримати вас до приїзду поліції тільки в тому випадку, якщо для цього є серйозні підстави, наприклад,  якщо охоронець, продавці чи інші покупці помітили факт крадіжки,  камери відеоспостереження зафіксували факт крадіжки, - на виході з супермаркету спрацювала рамка сигналізації.
Згідно із законом охоронець вправі застосувати фізичну силу та спеціальні засоби, щоб запобігти злочинові або для самооборони. Але це не означає, що він може повалити людини на підлогу, якщо зрозуміє, що той вкрав пачку печива. Якщо справа дійде до судового розгляду, суд повинен враховувати, чи співмірні дії охоронця збитку, від якого він намагався уберегти магазин або офіс.
''';
final String kShopPoliceSubtitle =
    'Стаття 16 Закону України Про охоронну діяльність. Порядок застосування персоналом охорони заходів фізичного впливу та спеціальних засобів';

final String kYouPoliceName = 'Підстави для виклику Вами Поліції';
final String kYouPoliceTitle =
    '''Кожна людина має право на свободу та особисту недоторканність. 
У випадку завідомо незаконного затримання порушник карається позбавленням права обіймати певні посади чи займатися певною діяльністю на строк до п’яти років або обмеженням волі на строк до трьох років. 
Якщо вони спричинили тяжкі наслідки або були вчинені з корисливих мотивів чи в інших особистих інтересах, - караються позбавленням волі на строк від п’яти до десяти років з позбавленням права обіймати певні посади чи займатися певною діяльністю на строк до трьох років
''';
final String kYouPoliceSubtitle =
    'Стаття 29 Конституції України, ст.289,  Цивільного кодексу України, ст.371 Кримінального Кодексу України ';

final String kAvailableName =
    'Залишайтеся в холі магазину на очах у покупців і об’єктивах відеокамер';
final String kAvailableTitle =
    '''Не йти в кімнату для огляду щоб уникнути можливого побиття чи підкидання товару. Якщо охорона наполеглива в своєму бажанні усамітнитися з покупцем, громадянину доцільно викликати поліцію і повідомити про затримання, застосування або загрози застосування насильства з боку охорони і, не проходячи в «кімнату», очікувати її приїзду.
Зберігати спокій і витримку, щоб потім не звинуватили в порушенні громадського порядку. При образах з боку «охоронців», не піддаватися на провокації і мовчати. Пізніше можна буде використовувати ці факти при написанні скарг до прокуратури.''';
final String kAvailableSubtitle =
    'фіксувати можна все, крім документів, діяльність П гласна ст.9 ч.1 З-н про нац П';

final String kArrestName = 'Скарга за безпідставне затримання';
final String kArrestTitle =
    '''У коректній формі вимагати Книгу зауважень і пропозицій, куди внести претензії до посадових осіб магазину. Забороняється вимагати від покупця пред'явлення документів, що засвідчують особу, або пояснення причин для надання книги.
Покупці, потерпілі від незаконних дій працівників приватної охорони, мають право на компенсацію моральної шкоди, подавши позов до охоронної організації, чиї працівники завдали шкоди.
Якщо охоронець порушив вимоги посадової інструкції, покупець має право звернутися зі скаргою на його дії до адміністрації закладу. 
На протиправні дії охоронників можна поскаржитися до інспекції у справах захисту прав споживачів, звернутись зі скаргою до прокуратури чи поліції або ж із позовом до суду.''';
final String kArrestSubtitle =
    'Фіксувати можна все, крім документів, діяльність П гласна ст.9 ч.1 З-н про нац П';

////////////////////////////////////////

final String kStopName =
    'Рекомендовані дії при зупинці автомобіля Поліцейським';
final String kStopTitle =
    '''1. Зупинити автомобіль згідно з ПДР в дозволеному місці
2. Включити аварійну сигналізацію
3. Заблокувати двері
4. Привідкрити вікно
5. Увімкнути відеофіксацію 
6. Покласти руки на кермо''';
final String kStopSubTitle = '';

final String kMeetName = 'Поліцейський зобов\'язаний';
final String kMeetTitle =
    'Поліцейський зобов’язаний поінформувати водія про конкретну причину зупинення ним транспортного засобу з детальним описом підстави зупинки';
final String kMeetSubTitle =
    'Закон України про національну поліцію, ст.35 ч.1 ';

final String kWhyName = 'Законність зупинки і перевірки документів';
final String kWhyTitleN = '''При зупинці
Поліцейський зобов’язаний поінформувати водія про конкретну причину зупинення ним транспортного засобу з детальним описом підстави зупинки ст35п3 ЗУпНП

Закон про нац поліцію ст31 
Превентивні заходи п1 Перевірка документів
ст32  п1.2 якщо існує достатньо підстав вважати, що особа вчинила чи має намір вчинити правопорушення.

Підставою є наявність Доказів ст251 КУпАП
Доказами в справі про адміністративне правопорушення, є будь-які фактичні дані
Дані - це поясненнями особи, яка притягається до адміністративної відповідальності, потерпілих, свідків, висновком експерта, речовими доказами, показаннями технічних приладів та технічних засобів, що мають функції фото- і кінозйомки, відеозапису

Ст 16 Закону Про дорожній рух
Водій зобовязаний виконувати передбачені законом вимоги поліцейського

Відповідно до ст8 ЗУпНП і ст 19 КУ 
Поліція діє лише на підставі, в межах повноважень та у спосіб, що передбачені КУ і законами У.
''';
final String kWhyTitleNs = 'Причини для зупинки';
final String kWhyTitle = '''1.	Порушення ПДР;
2.	Очевидні ознаки, що свідчать про технічну несправність транспортного засобу;
3.	Інформація, про причетність водія або пасажирів до вчинення ДТП, кримінального чи адміністративного правопорушення, або якщо є інформація, що свідчить про те, що транспортний засіб чи вантаж можуть бути об’єктом чи знаряддям учинення ДТП, кримінального чи адміністративного правопорушення;
4.	Транспортний засіб перебуває в розшуку;
5.	Необхідно здійснити опитування водія чи пасажирів про обставини вчинення ДТП, кримінального чи адміністративного правопорушення, свідками якого вони є або могли бути;
6.	Необхідно залучити водія транспортного засобу до надання допомоги іншим учасникам дорожнього руху або поліцейським або як свідка під час оформлення протоколів про адміністративні правопорушення чи матеріалів ДТП;
7.	Уповноважений орган державної влади прийняв рішення про обмеження чи заборону руху;
8.	Спосіб закріплення вантажу на транспортному засобі створює небезпеку для інших учасників дорожнього руху;
9.	Порушення порядку визначення і використання на транспортному засобі спеціальних світлових або звукових сигнальних пристроїв;
10.	Зупинка транспортного засобу, який зареєстрований в іншій країні, здійснюється з метою виявлення його передачі у володіння, користування або розпорядження особам, які не ввозили такий транспортний засіб на митну територію України або не поміщували в митний режим транзиту.

Доповнення до ч.1 п.10
2. Поліцейський зобов’язаний зупиняти транспортні засоби у разі:
1) Якщо є інформація про порушення власником автомобіля: 
- строків тимчасового ввезення та/або переміщення 
- використання автомобіля для цілей підприємницької діяльності та/або отримання доходів в Україні, 
- розкомплектування чи передачу у володіння, користування або розпорядження такого транспортного засобу особам, які не ввозили такий транспортний засіб на митну територію України або не поміщували в митний режим транзиту;
2) Якщо є інформація, що автомобіль, який зареєстрований в іншій країні:
- не зареєстрований в Україні у встановлені законодавством строки  
- перебуває на території України з порушенням строків тимчасового ввезення та/або переміщення 
- використовується для цілей підприємницької діяльності та/або отримання доходів в Україні 
- переданий у володіння, користування або розпорядження особам, які не ввозили такий транспортний засіб на митну територію України або не поміщували в митний режим транзиту.
''';
final String kWhySubTitle = 'Закон України про національну поліцію, ст.35 ч.1 ';

final String kDemandName = 'Підготовка до розгляду справи';
final String kDemandbTitle = '''Посадова особа вирішує:
1. чи належить до його компетенції розгляд даної справи;
2. чи правильно складено протокол та інші матеріали справи про адміністративне правопорушення;
3. чи сповіщено осіб, які беруть участь у розгляді справи, про час і місце її розгляду;
4. чи витребувано необхідні додаткові матеріали;
5. чи підлягають задоволенню клопотання особи, яка притягається до адміністративної відповідальності, потерпілого, їх законних представників і адвоката.
ст 278КУпАП

Ознайомлення з матеріалами справи.
знайомитися з матеріалами справи, давати пояснення, подавати докази, заявляти клопотання;
cт 268 КУпАП 

Завданнями провадження в справах про адміністративні правопорушення є: 
своєчасне, всебічне, повне і об’єктивне з’ясування обставин кожної справи, 
вирішення її в точній відповідності з законом, 
забезпечення виконання винесеної постанови, 
виявлення причин та умов, що сприяють вчиненню адміністративних правопорушень, запобігання правопорушенням, 
виховання громадян у дусі додержання законів, зміцнення законності.
cт 245 КУпАП 

Провадження в справі про адміністративне правопорушення не може бути розпочато, а розпочате підлягає закриттю за таких обставин:
cт 247 КУпАП 
1) відсутність події і складу адміністративного правопорушення;
Наявність такої події доводиться шляхом надання доказів ст251 КУпАП
Відсутність доказів говорить про те, що ви не можете притягнути до адміністративного правопорушення.''';
final String kDemandSubTitle = 'КУпАП cn245-278 ';

final String kExamName = 'Порядок розгляду справи';
final String kExamTitle =
    '''Порядок розгляду справи про адміністративне правопорушення
cт 279 КУпАП
Розгляд справи
Розгляд справи розпочинається з оголошення складу колегіального органу або представлення посадової особи, яка розглядає дану справу 
Оголошується, яка справа підлягає розгляду
Оголошується особа, що притягається до відповідальності
Розяснюються права і обовязки
Зслуховуються особи, що беруть участь у розгляді справи: досліджуються докази і клопотання''';
final String kExamSubTitle =
    'cт 279 КУпАП';

final String kErrorName = 'Типові помилки';
final String kErrorTitle = 'Закон України про національну поліцію, ст.35 ч.1 ';
final String kErrorSubTitle =
    'Закон України про національну поліцію, ст.35 ч.1 ';
