import 'package:flutter/material.dart';

// Inspired by dropdown buttons demo in offical flutter gallery:
// https://github.com/flutter/flutter/blob/master/examples/flutter_gallery/lib/demo/material/buttons_demo.dart
class DropdownButtonExample extends StatefulWidget {
  const DropdownButtonExample({Key? key}) : super(key: key);

  @override
  State<StatefulWidget> createState() => _DropdownButtonExampleState();
}

class _DropdownButtonExampleState extends State<DropdownButtonExample> {
  static const menuItems = <String>[
    'One',
    'Two',
    'Three',
    'Four',
  ];
  final List<DropdownMenuItem<String>> _dropDownMenuItems = menuItems
      .map(
        (String value) => DropdownMenuItem<String>(
          value: value,
          child: Text(value),
        ),
      )
      .toList();
  final List<PopupMenuItem<String>> _popUpMenuItems = menuItems
      .map(
        (String value) => PopupMenuItem<String>(
          value: value,
          child: Text(value),
        ),
      )
      .toList();

  String _btn1SelectedVal = 'One';
  String? _btn2SelectedVal;
  late String _btn3SelectedVal;

  @override
  Widget build(BuildContext context) {
    return Column(
      children: <Widget>[
        ListTile(
          title: const Text('DropDownButton with default:'),
          trailing: DropdownButton<String>(
            // Must be one of items.value.
            value: _btn1SelectedVal,
            onChanged: (String? newValue) {
              if (newValue != null) {
                setState(() => _btn1SelectedVal = newValue);
              }
            },
            items: _dropDownMenuItems,
          ),
        ),
        ListTile(
          title: const Text('DropDownButton with hint:'),
          trailing: DropdownButton(
            value: _btn2SelectedVal,
            hint: const Text('Choose'),
            onChanged: (String? newValue) {
              if (newValue != null) {
                setState(() => _btn2SelectedVal = newValue);
              }
            },
            items: _dropDownMenuItems,
          ),
        ),
        ListTile(
          title: const Text('Popup menu button:'),
          trailing: PopupMenuButton<String>(
            onSelected: (String newValue) {
              _btn3SelectedVal = newValue;
              ScaffoldMessenger.of(context).showSnackBar(
                SnackBar(
                  content: Text(_btn3SelectedVal),
                ),
              );
            },
            itemBuilder: (BuildContext context) => _popUpMenuItems,
          ),
        ),
      ],
    );
  }
}


// import 'package:flutter/material.dart';

// class StreetLow extends StatelessWidget {
//   const StreetLow({Key? key}) : super(key: key);

//   @override
//   Widget build(BuildContext context) {
//     return ListView(
//       children: [
//         Text(
//             '''Існує три основні процедури здійснення одного заходу (огляду особи) залежно від процесуального порядку:

// 1. Поверхнева перевірка – візуальний огляд особи/речей особи, яка не підозрюється у вчиненні адміністративного/кримінального правопорушення, проте існує достатньо підстав вважати, що вона має при собі річ, обіг якої заборонено чи обмежено або становить загрозу життю чи здоров’ю такої особи або інших осіб (ст. 34 Закону України «Про Національну поліцію»);

// 2. Особистий огляд і огляд речей особи – застосовується до особи, щодо якої є відомості про вчинення нею адміністративного правопорушення або затриманої за його вчинення (наприклад, огляд перед поміщенням до кімнати для затриманих і доставлених (КЗД) (ст. 264 Кодексу України про адміністративні правопорушення (далі – КУпАП);

// 3. Особистий обшук/обшук особи – застосовується до особи, затриманої через підозру у вчиненні кримінального правопорушення або особи, яка бере участь у проведенні обшуку житла або іншого володіння особи (ч. 8 ст. 191, ч.ч. 3, 6 ст. 208, ч. 5 ст. 236 Кримінального процесуального кодексу України (далі - КПК України)).

// Ці процедури не є альтернативними, тобто їх не можна застосувати на власний розсуд, а чітко регламентовані законодавством і повинні застосовуватись за умов і на підставах, що чітко ним визначені. Тільки поверхнева перевірка може передувати іншим видам огляду, але не навпаки. Адже спосіб, у який вона здійснюється (візуальний огляд), відрізняється від огляду, що передбачає тактильний контакт, тобто має різні мету і результат.
// Під час проведення превентивного заходу поліція зобов’язана повідомити особі про причини застосування до неї превентивних заходів, а також довести до її відома нормативно-правові акти, на підставі яких застосовуються такі заходи (ч. 2 ст. 31 Закону України «Про Національну поліцію»), тобто роз’яснити порядок проведення огляду/поверхневої перевірки, а також права особи при його здійсненні.

// Інститут поверхневої перевірки встановлений ст. 34 Закону України «Про Національну поліцію» та входить до складу поліцейських превентивних заходів.
// Поверхнева перевірка як превентивний поліцейський захід є здійсненням візуального огляду особи, проведенням по поверхні вбрання особи рукою, спеціальним приладом або засобом, візуальним оглядом речі або транспортного засобу.
// Поліцейський для здійснення поверхневої перевірки особи може зупиняти осіб та/або оглядати їх, якщо існує достатньо підстав вважати, що особа має при собі річ, обіг якої заборонено чи обмежено або яка становить загрозу життю чи здоров’ю такої особи або інших осіб.
// Поверхнева перевірка здійснюється поліцейським відповідної статі. У невідкладних випадках поверхневу перевірку може здійснити будь-який поліцейський лише з використанням спеціального приладу або засобу.
// Поліцейський може здійснювати поверхневу перевірку речі або транспортного засобу:
// 1) якщо існує достатньо підстав вважати, що в транспортному засобі знаходиться правопорушник або особа, свобода якої обмежується в незаконний спосіб;
// 2) якщо існує достатньо підстав вважати, що в транспортному засобі знаходиться річ, обіг якої заборонено чи обмежено або яка становить загрозу життю чи здоров’ю такої особи або інших осіб;
// 3) якщо існує достатньо підстав вважати, що річ або транспортний засіб є знаряддям вчинення правопорушення та/або знаходиться в тому місці, де може бути скоєно кримінальне правопорушення, для запобігання якого необхідно провести поверхневу перевірку.
// Поверхнева перевірка речі або транспортного засобу здійснюється шляхом візуального огляду речі та/або транспортного засобу або візуального огляду салону та багажника транспортного засобу. Поліцейський при здійсненні поверхневої перевірки має право вимагати відкрити кришку багажника та/або двері салону.
// Під час поверхневої перевірки речі або транспортного засобу особа повинна самостійно показати поліцейському вміст особистих речей чи транспортного засобу.
// При виявленні в ході поверхневої перевірки будь-яких слідів правопорушення поліцейський забезпечує їх схоронність та огляд відповідно до вимог ст. 237 КПК України.

// Згідно з положеннями ч. 3 ст. 208 КПК України уповноважена службова особа, слідчий, прокурор може здійснити обшук затриманої особи з дотриманням правил, передбачених ч. 7 ст. 223 і ст. 236 КПК України.
// '''),

//         Text(''),
//       ],
//     );
//   }
// }


// class nameClas extends StatelessWidget {

//   @override
//   Widget build(BuildContext context) {
//     return Container(
//     );
//   }
// }